#-*-coding:utf-8 -*-
import requests, re, random, configparser, datetime, os
from pandas import Series, DataFrame
import pandas as pd
from bs4 import BeautifulSoup
from flask import Flask, request, abort
from imgurpython import ImgurClient

from linebot import (
    LineBotApi, WebhookHandler
)
from linebot.exceptions import (
    InvalidSignatureError
)
from linebot.models import *

app = Flask(__name__)
config = configparser.ConfigParser()
config.read("config.ini")

line_bot_api = LineBotApi(config['line_bot']['Channel_Access_Token'])
handler = WebhookHandler(config['line_bot']['Channel_Secret'])


@app.route("/callback", methods=['POST'])
def callback():
    # get X-Line-Signature header value
    signature = request.headers['X-Line-Signature']

    # get request body as text
    body = request.get_data(as_text=True)
    # print("body:",body)
    app.logger.info("Request body: " + body)

    # handle webhook body
    try:
        handler.handle(body, signature)
    except InvalidSignatureError:
        abort(400)

    return 'ok'

locallist = {'臺北市':'Taipei_City.htm', '新北市':'New_Taipei_City.htm',
             '桃園市':'Taoyuan_City.htm', '臺中市':'Taichung_City.htm',
             '臺南市':'Tainan_City.htm', '高雄市':'Kaohsiung_City.htm',
             '基隆市':'Keelung_City.htm', '新竹市':'Hsinchu_City.htm',
             '新竹縣':'Hsinchu_County.htm', '苗栗縣':'Miaoli_County.htm',
             '彰化縣':'Changhua_County.htm', '南投縣':'Nantou_County.htm',
             '雲林縣':'Yunlin_County.htm', '嘉義市':'Chiayi_City.htm',
             '嘉義縣':'Chiayi_County.htm', '屏東縣':'Pingtung_County.htm',
             '宜蘭縣':'Yilan_County.htm', '花蓮縣':'Hualien_County.htm',
             '臺東縣':'Taitung_County.htm', '澎湖縣':'Penghu_County.htm',
             '金門縣':'Kinmen_County.htm', '連江縣':'Lienchiang_County.htm',
             '台北市':'Taipei_City.htm', '台中市':'Taichung_City.htm',
             '台南市':'Tainan_City.htm', '台東縣':'Taitung_County.htm',
             '馬祖':'Lienchiang_County.htm'}
taipeilist = {'台北市松山區':'6300100.htm', '台北市信義區':'6300200.htm','台北市大安區':'6300300.htm', '台北市中山區':'6300400.htm','台北市中正區':'6300500.htm', '台北市大同區':'6300600.htm',
              '台北市萬華區':'6300700.htm', '台北市文山區':'6300800.htm','台北市南港區':'6300900.htm', '台北市內湖區':'6301000.htm','台北市士林區':'6301100.htm', '台北市北投區':'6301200.htm',
              '臺北市松山區':'6300100.htm', '臺北市信義區':'6300200.htm','臺北市大安區':'6300300.htm', '臺北市中山區':'6300400.htm','臺北市中正區':'6300500.htm', '臺北市大同區':'6300600.htm',
              '臺北市萬華區':'6300700.htm', '臺北市文山區':'6300800.htm','臺北市南港區':'6300900.htm', '臺北市內湖區':'6301000.htm','臺北市士林區':'6301100.htm', '臺北市北投區':'6301200.htm',
              '松山區':'6300100.htm', '信義區':'6300200.htm','大安區':'6300300.htm', '中山區':'6300400.htm','中正區':'6300500.htm', '大同區':'6300600.htm',
              '萬華區':'6300700.htm', '文山區':'6300800.htm','南港區':'6300900.htm', '內湖區':'6301000.htm','士林區':'6301100.htm', '北投區':'6301200.htm',
              '台北松山':'6300100.htm', '台北信義':'6300200.htm','台北大安':'6300300.htm', '台北中山':'6300400.htm','台北中正':'6300500.htm', '台北大同':'6300600.htm',
              '台北萬華':'6300700.htm', '台北文山':'6300800.htm','台北南港':'6300900.htm', '台北內湖':'6301000.htm','台北士林':'6301100.htm', '台北北投':'6301200.htm',
              '基隆市中正區':'1001701.htm','基隆市七堵區':'1001702.htm','基隆市暖暖區':'1001703.htm','基隆市仁愛區':'1001704.htm','基隆市中山區':'1001705.htm','基隆市安樂區':'1001706.htm','基隆市信義區':'1001707.htm',
              '基隆中正':'1001701.htm','基隆七堵':'1001703.htm','基隆暖暖':'1001703.htm','基隆仁愛':'1001704.htm','基隆中山':'1001705.htm','基隆安樂':'1001706.htm','基隆信義':'1001707.htm',
              '新北市板橋區':'6500100.htm','新北市三重區':'6500200.htm','新北市中和區':'6500300.htm','新北市永和區':'6500400.htm','新北市新莊區':'6500500.htm','新北市新店區':'6500600.htm','新北市樹林區':'6500700.htm',
              '新北市鶯歌區':'6500800.htm','新北市三峽區':'6500900.htm','新北市淡水區':'6501000.htm','新北市汐止區':'6501100.htm','新北市瑞芳區':'6501200.htm','新北市土城區':'6501300.htm','新北市蘆洲區':'6501400.htm',
              '新北市五股區':'6501500.htm','新北市泰山區':'6501600.htm','新北市林口區':'6501700.htm','新北市深坑區':'6501800.htm','新北市石碇區':'6501900.htm','新北市坪林區':'6502000.htm','新北市三芝區':'6502100.htm',
              '新北市石門區':'6502200.htm','新北市八里區':'6502300.htm','新北市平溪區':'6502400.htm','新北市雙溪區':'6502500.htm','新北市貢寮區':'6502600.htm','新北市金山區':'6502700.htm','新北市萬里區':'6502800.htm',
              '新北市烏來區':'6502900.htm','新北板橋區':'6500100.htm','新北三重區':'6500200.htm','新北中和區':'6500300.htm','新北永和區':'6500400.htm','新北新莊區':'6500500.htm','新北新店區':'6500600.htm','新北樹林區':'6500700.htm',
              '新北鶯歌區':'6500800.htm','新北三峽區':'6500900.htm','新北淡水區':'6501000.htm','新北汐止區':'6501100.htm','新北瑞芳區':'6501200.htm','新北土城區':'6501300.htm','新北蘆洲區':'6501400.htm',
              '新北五股區':'6501500.htm','新北泰山區':'6501600.htm','新北林口區':'6501700.htm','新北深坑區':'6501800.htm','新北石碇區':'6501900.htm','新北坪林區':'6502000.htm','新北三芝區':'6502100.htm',
              '新北石門區':'6502200.htm','新北八里區':'6502300.htm','新北平溪區':'6502400.htm','新北雙溪區':'6502500.htm','新北貢寮區':'6502600.htm','新北金山區':'6502700.htm','新北萬里區':'6502800.htm',
              '新北烏來區':'6502900.htm','板橋區':'6500100.htm','三重區':'6500200.htm','中和區':'6500300.htm','永和區':'6500400.htm','新莊區':'6500500.htm','新店區':'6500600.htm','樹林區':'6500700.htm',
              '鶯歌區':'6500800.htm','三峽區':'6500900.htm','淡水區':'6501000.htm','汐止區':'6501100.htm','瑞芳區':'6501200.htm','土城區':'6501300.htm','蘆洲區':'6501400.htm',
              '五股區':'6501500.htm','泰山區':'6501600.htm','林口區':'6501700.htm','深坑區':'6501800.htm','石碇區':'6501900.htm','坪林區':'6502000.htm','三芝區':'6502100.htm',
              '石門區':'6502200.htm','八里區':'6502300.htm','平溪區':'6502400.htm','雙溪區':'6502500.htm','貢寮區':'6502600.htm','金山區':'6502700.htm','萬里區':'6502800.htm',
              '烏來區':'6502900.htm','板橋':'6500100.htm','三重':'6500200.htm','中和':'6500300.htm','永和':'6500400.htm','新莊':'6500500.htm','新店':'6500600.htm','樹林':'6500700.htm',
              '鶯歌':'6500800.htm','三峽':'6500900.htm','淡水':'6501000.htm','汐止':'6501100.htm','瑞芳':'6501200.htm','土城':'6501300.htm','蘆洲':'6501400.htm',
              '五股':'6501500.htm','泰山':'6501600.htm','林口':'6501700.htm','深坑':'6501800.htm','石碇':'6501900.htm','坪林':'6502000.htm','三芝':'6502100.htm',
              '石門':'6502200.htm','八里':'6502300.htm','平溪':'6502400.htm','雙溪':'6502500.htm','貢寮':'6502600.htm','金山':'6502700.htm','萬里':'6502800.htm',
              '烏來':'6502900.htm','桃園市桃園區':'6800100.htm','桃園市中壢區':'6800200.htm','桃園市大溪區':'6800300.htm','桃園市楊梅區':'6800400.htm','桃園市蘆竹區':'6800500.htm',
              '桃園市大園區':'6800600.htm','桃園市龜山區':'6800700.htm','桃園市八德區':'6800800.htm','桃園市龍潭區':'6800900.htm','桃園市平鎮區':'6801000.htm','桃園市新屋區':'6801100.htm',
              '桃園市觀音區':'6801200.htm','桃園市復興區':'6801300.htm','桃園區':'6800100.htm','中壢區':'6800200.htm','大溪區':'6800300.htm','楊梅區':'6800400.htm','蘆竹區':'6800500.htm',
              '大園區':'6800600.htm','龜山區':'6800700.htm','八德區':'6800800.htm','龍潭區':'6800900.htm','平鎮區':'6801000.htm','新屋區':'6801100.htm',
              '觀音區':'6801200.htm','復興區':'6801300.htm','桃園':'6800100.htm','中壢':'6800200.htm','大溪':'6800300.htm','楊梅':'6800400.htm','蘆竹':'6800500.htm',
              '大園':'6800600.htm','龜山':'6800700.htm','八德':'6800800.htm','龍潭':'6800900.htm','平鎮':'6801000.htm','新屋':'6801100.htm',
              '觀音':'6801200.htm','復興':'6801300.htm','新竹市東區':'1001801.htm','新竹市北區':'1001802.htm','新竹市香山區':'1001803.htm','東區':'1001801.htm','北區':'1001802.htm','新竹香山':'1001803.htm',
              '連江縣南竿鄉':'0900701.htm','連江縣北竿鄉':'0900702.htm','連江縣莒光鄉':'0900703.htm','連江縣東引鄉':'0900704.htm','馬祖南竿鄉':'6801200.htm','馬祖北竿鄉':'6801300.htm','馬祖莒光鄉':'1001801.htm','馬祖東引鄉':'1001802.htm',
              '南竿':'0900701.htm','北竿':'0900702.htm','莒光':'0900703.htm','東引':'0900704.htm','金門縣金城鎮':'0902001.htm','金門縣金沙鎮':'0902002.htm','金門縣金湖鎮':'0902003.htm','金門縣金寧鄉':'0902004.htm','金門縣烈嶼鄉':'0902005.htm','金門縣烏坵鄉':'0902006.htm',
              '金城鎮':'0902001.htm','金沙鎮':'0902002.htm','金湖鎮':'0902003.htm','金寧鄉':'0902004.htm','烈嶼鄉':'0902005.htm','烏坵鄉':'0902006.htm','金城':'0902001.htm','金沙':'0902002.htm','金湖':'0902003.htm','金寧':'0902004.htm','烈嶼':'0902005.htm','烏坵':'0902006.htm',
              '澎湖縣馬公市':'1001601.htm','澎湖縣湖西鄉':'1001602.htm','澎湖縣白沙鄉':'1001603.htm','澎湖縣西嶼鄉':'1001604.htm','澎湖縣望安鄉':'1001605.htm','澎湖縣七美鄉':'1001606.htm','馬公市':'1001601.htm','湖西鄉':'1001602.htm','白沙鄉':'1001603.htm','西嶼鄉':'1001604.htm','望安鄉':'1001605.htm','七美鄉':'1001606.htm',
              '馬公':'1001601.htm','湖西':'1001602.htm','白沙':'1001603.htm','西嶼':'1001604.htm','望安':'1001605.htm','七美':'1001606.htm',
              '宜蘭縣宜蘭市':'1000201.htm','宜蘭縣羅東鎮':'1000202.htm','宜蘭縣蘇澳鎮':'1000203.htm','宜蘭縣頭城鎮':'1000204.htm','宜蘭縣礁溪鄉':'1000205.htm','宜蘭縣壯圍鄉':'1000206.htm','宜蘭縣員山鄉':'1000207.htm','宜蘭縣冬山鄉':'1000208.htm','宜蘭縣五結鄉':'1000209.htm','宜蘭縣三星鄉':'1000210.htm','宜蘭縣大同鄉':'1000211.htm','宜蘭縣南澳鄉':'1000212.htm',
              '宜蘭宜蘭':'1000201.htm','宜蘭羅東':'1000202.htm','宜蘭蘇澳':'1000203.htm','宜蘭頭城':'1000204.htm','宜蘭礁溪':'1000205.htm','宜蘭壯圍':'1000206.htm','宜蘭員山':'1000207.htm','宜蘭冬山':'1000208.htm','宜蘭五結':'1000209.htm','宜蘭三星':'1000210.htm','宜蘭大同':'1000211.htm','宜蘭南澳':'1000212.htm',
              '宜蘭':'1000201.htm','羅東':'1000202.htm','蘇澳':'1000203.htm','頭城':'1000204.htm','礁溪':'1000205.htm','壯圍':'1000206.htm','員山':'1000207.htm','冬山':'1000208.htm','五結':'1000209.htm','三星':'1000210.htm','大同':'1000211.htm','南澳':'1000212.htm',
              '花蓮縣花蓮市':'1001501.htm','花蓮縣鳳林鎮':'1001502.htm','花蓮縣玉里鎮':'1001503.htm','花蓮縣新城鄉':'1001504.htm','花蓮縣吉安鄉':'1001505.htm','花蓮縣壽豐鄉':'1001506.htm','花蓮縣光復鄉':'1001507.htm','花蓮縣豐濱鄉':'1001508.htm','花蓮縣瑞穗鄉':'1001509.htm','花蓮縣富里鄉':'1001510.htm','花蓮縣秀林鄉':'1001511.htm','花蓮縣萬榮鄉':'1001512.htm','花蓮縣卓溪鄉':'1001513.htm',
              '花蓮市':'1001501.htm','鳳林鎮':'1001502.htm','玉里鎮':'1001503.htm','新城鄉':'1001504.htm','吉安鄉':'1001505.htm','壽豐鄉':'1001506.htm','光復鄉':'1001507.htm','豐濱鄉':'1001508.htm','瑞穗鄉':'1001509.htm','富里鄉':'1001510.htm','秀林鄉':'1001511.htm','萬榮鄉':'1001512.htm','卓溪鄉':'1001513.htm',
              '花蓮':'1001501.htm','鳳林':'1001502.htm','玉里':'1001503.htm','新城':'1001504.htm','吉安':'1001505.htm','壽豐':'1001506.htm','光復':'1001507.htm','豐濱':'1001508.htm','瑞穗':'1001509.htm','富里':'1001510.htm','秀林':'1001511.htm','萬榮':'1001512.htm','卓溪':'1001513.htm',
              '台東縣臺東市':'1001401.htm','台東縣成功鎮':'1001402.htm','台東縣關山鎮':'1001403.htm','台東縣卑南鄉':'1001404.htm','台東縣鹿野鄉':'1001405.htm','台東縣池上鄉':'1001406.htm','台東縣東河鄉':'1001407.htm','台東縣長濱鄉':'1001408.htm','台東縣太麻里鄉':'1001409.htm','台東縣大武鄉':'1001410.htm','台東縣綠島鄉':'1001411.htm','台東縣海端鄉':'1001412.htm','台東縣延平鄉':'1001413.htm','台東縣金峰鄉':'1001414.htm','台東縣達仁鄉':'1001415.htm','台東縣蘭嶼鄉':'1001416.htm',
              '臺東縣臺東市':'1001401.htm','臺東縣成功鎮':'1001402.htm','臺東縣關山鎮':'1001403.htm','臺東縣卑南鄉':'1001404.htm','臺東縣鹿野鄉':'1001405.htm','臺東縣池上鄉':'1001406.htm','臺東縣東河鄉':'1001407.htm','臺東縣長濱鄉':'1001408.htm','臺東縣太麻里鄉':'1001409.htm','臺東縣大武鄉':'1001410.htm','臺東縣綠島鄉':'1001411.htm','臺東縣海端鄉':'1001412.htm','臺東縣延平鄉':'1001413.htm','臺東縣金峰鄉':'1001414.htm','臺東縣達仁鄉':'1001415.htm','臺東縣蘭嶼鄉':'1001416.htm',
              '臺東成功':'1001402.htm','臺東關山':'1001403.htm','臺東卑南':'1001404.htm','臺東鹿野':'1001405.htm','臺東池上':'1001406.htm','臺東東河':'1001407.htm','臺東長濱':'1001408.htm','臺東太麻里':'1001409.htm','太麻里隔壁':'1001409.htm','臺東大武':'1001410.htm','臺東綠島':'1001411.htm','臺東海端':'1001412.htm','臺東延平':'1001413.htm','臺東金峰':'1001414.htm','臺東達仁':'1001415.htm','臺東蘭嶼':'1001416.htm',
              '台東成功':'1001402.htm','台東關山':'1001403.htm','台東卑南':'1001404.htm','台東鹿野':'1001405.htm','台東池上':'1001406.htm','台東東河':'1001407.htm','台東長濱':'1001408.htm','台東太麻里':'1001409.htm','太麻里隔壁':'1001409.htm','台東大武':'1001410.htm','台東綠島':'1001411.htm','台東海端':'1001412.htm','台東延平':'1001413.htm','台東金峰':'1001414.htm','台東達仁':'1001415.htm','台東蘭嶼':'1001416.htm',
              '臺東':'1001401.htm','台東':'1001401.htm','成功':'1001402.htm','關山':'1001403.htm','卑南':'1001404.htm','鹿野':'1001405.htm','池上':'1001406.htm','東河':'1001407.htm','長濱':'1001408.htm','太麻里':'1001409.htm','大武':'1001410.htm','綠島':'1001411.htm','海端':'1001412.htm','延平':'1001413.htm','金峰':'1001414.htm','達仁':'1001415.htm','蘭嶼':'1001416.htm',
              '新竹縣竹北市':'1000401.htm','新竹縣竹東鎮':'1000402.htm','新竹縣新埔鎮':'1000403.htm','新竹縣關西鎮':'1000404.htm','新竹縣湖口鄉':'1000405.htm','新竹縣新豐鄉':'1000406.htm','新竹縣芎林鄉':'1000407.htm','新竹縣橫山鄉':'1000408.htm','新竹縣北埔鄉':'1000409.htm','新竹縣寶山鄉':'1000410.htm','新竹縣峨眉鄉':'1000411.htm','新竹縣尖石鄉':'1000412.htm','新竹縣五峰鄉':'1000413.htm',
              '竹北市':'1000401.htm','竹東鎮':'1000402.htm','新埔鎮':'1000403.htm','關西鎮':'1000404.htm','湖口鄉':'1000405.htm','新豐鄉':'1000406.htm','芎林鄉':'1000407.htm','橫山鄉':'1000408.htm','北埔鄉':'1000409.htm','寶山鄉':'1000410.htm','峨眉鄉':'1000411.htm','尖石鄉':'1000412.htm','五峰鄉':'1000413.htm','竹北':'1001401.htm','竹東':'1000402.htm','新埔':'1000403.htm','關西':'1000404.htm','湖口':'1000405.htm','新豐':'1000406.htm','芎林':'1000407.htm','橫山':'1000408.htm','北埔':'1000409.htm','寶山':'1000410.htm','峨眉':'1000411.htm','尖石':'1000412.htm','五峰':'1000413.htm',
              '苗栗縣苗栗市':'1000501.htm','苗栗縣苑裡鎮':'1000502.htm','苗栗縣通霄鎮':'1000503.htm','苗栗縣竹南鎮':'1000504.htm','苗栗縣頭份市':'1000505.htm','苗栗縣後龍鎮':'1000506.htm','苗栗縣卓蘭鎮':'1000507.htm','苗栗縣大湖鄉':'1000508.htm','苗栗縣公館鄉':'1000509.htm','苗栗縣銅鑼鄉':'1000510.htm','苗栗縣南庄鄉':'1000511.htm','苗栗縣頭屋鄉':'1000512.htm','苗栗縣三義鄉':'1000513.htm','苗栗縣西湖鄉':'1000515.htm','苗栗縣造橋鄉':'1000515.htm','苗栗縣三灣鄉':'1000516.htm','苗栗縣獅潭鄉':'1000517.htm','苗栗縣泰安鄉':'1000518.htm',
              '苗栗市':'1000501.htm','苑裡鎮':'1000502.htm','通霄鎮':'1000503.htm','竹南鎮':'1000504.htm','頭份市':'1000505.htm','後龍鎮':'1000506.htm','卓蘭鎮':'1000507.htm','大湖鄉':'1000508.htm','公館鄉':'1000509.htm','銅鑼鄉':'1000510.htm','南庄鄉':'1000511.htm','頭屋鄉':'1000512.htm','三義鄉':'1000513.htm','西湖鄉':'1000515.htm','造橋鄉':'1000515.htm','三灣鄉':'1000516.htm','獅潭鄉':'1000517.htm','泰安鄉':'1000518.htm',
              '苗栗':'1000501.htm','苑裡':'1000502.htm','通霄':'1000503.htm','竹南':'1000504.htm','頭份':'1000505.htm','後龍':'1000506.htm','卓蘭':'1000507.htm','大湖':'1000508.htm','公館':'1000509.htm','銅鑼':'1000510.htm','南庄':'1000511.htm','頭屋':'1000512.htm','三義':'1000513.htm','西湖':'1000515.htm','造橋':'1000515.htm','三灣':'1000516.htm','獅潭':'1000517.htm','泰安':'1000518.htm',
              '南投縣南投市':'1000801.htm','南投縣埔里鎮':'1000802.htm','南投縣草屯鎮':'1000803.htm','南投縣竹山鎮':'1000804.htm','南投縣集集鎮':'1000805.htm','南投縣名間鄉':'1000806.htm','南投縣鹿谷鄉':'1000807.htm','南投縣中寮鄉':'1000808.htm','南投縣魚池鄉':'1000809.htm','南投縣國姓鄉':'1000810.htm','南投縣水里鄉':'1000811.htm','南投縣信義鄉':'1000812.htm','南投縣仁愛鄉':'1000813.htm',
              '南投':'1000801.htm','埔里鎮':'1000802.htm','草屯鎮':'1000803.htm','竹山鎮':'1000804.htm','集集鎮':'1000805.htm','名間鄉':'1000806.htm','鹿谷鄉':'1000807.htm','中寮鄉':'1000808.htm','魚池鄉':'1000809.htm','國姓鄉':'1000810.htm','水里鄉':'1000811.htm','信義鄉':'1000812.htm','仁愛鄉':'1000813.htm','嘉義市東區':'1002001.htm','嘉義市西區':'1002002.htm','嘉義東區':'1002001.htm','嘉義西區':'1002002.htm',
              '埔里':'1000802.htm','草屯':'1000803.htm','竹山':'1000804.htm','集集':'1000805.htm','名間':'1000806.htm','鹿谷':'1000807.htm','中寮':'1000808.htm','魚池':'1000809.htm','國姓':'1000810.htm','水里':'1000811.htm','信義':'1000812.htm','仁愛':'1000813.htm',
              '台中市東區':'6600200.htm','台中市南區':'6600300.htm', '台中市西區':'6600400.htm','台中市北區':'6600500.htm', '台中市西屯區':'6600600.htm','台中市南屯區':'6600700.htm', '台中市北屯區':'6600800.htm','台中市豐原區':'6600900.htm', '台中市東勢區':'6601000.htm','台中市大甲區':'6601100.htm', '台中市清水區':'6601200.htm','台中市沙鹿區':'6601300.htm', '台中市梧棲區':'6601400.htm','台中市后里區':'6601500.htm', '台中市神岡區':'6601600.htm','台中市潭子區':'6601700.htm', '台中市大雅區':'6601800.htm',
              '台中市新社區':'6601900.htm', '台中市石岡區':'6602000.htm','台中市外埔區':'6602100.htm', '台中市大安區':'6602200.htm','台中市烏日區':'6602300.htm', '台中市大肚區':'6602400.htm','台中市龍井區':'6602500.htm', '台中市霧峰區':'6602600.htm','台中市太平區':'6602700.htm', '台中市大里區':'6602800.htm','台中市和平區':'6602900.htm',
              '臺中市東區':'6600200.htm','臺中市南區':'6600300.htm', '臺中市西區':'6600400.htm','臺中市北區':'6600500.htm', '臺中市西屯區':'6600600.htm','臺中市南屯區':'6600700.htm', '臺中市北屯區':'6600800.htm','臺中市豐原區':'6600900.htm', '臺中市東勢區':'6601000.htm','臺中市大甲區':'6601100.htm', '臺中市清水區':'6601200.htm','臺中市沙鹿區':'6601300.htm', '臺中市梧棲區':'6601400.htm','臺中市后里區':'6601500.htm', '臺中市神岡區':'6601600.htm','臺中市潭子區':'6601700.htm', '臺中市大雅區':'6601800.htm',
              '臺中市新社區':'6601900.htm', '臺中市石岡區':'6602000.htm','臺中市外埔區':'6602100.htm', '臺中市大安區':'6602200.htm','臺中市烏日區':'6602300.htm', '臺中市大肚區':'6602400.htm','臺中市龍井區':'6602500.htm', '臺中市霧峰區':'6602600.htm','臺中市太平區':'6602700.htm', '臺中市大里區':'6602800.htm','臺中市和平區':'6602900.htm',
              '臺中東區':'6600200.htm','臺中南區':'6600300.htm', '臺中西區':'6600400.htm','臺中北區':'6600500.htm', '臺中西屯區':'6600600.htm','臺中南屯區':'6600700.htm', '臺中北屯區':'6600800.htm','臺中豐原區':'6600900.htm', '臺中東勢區':'6601000.htm','臺中大甲區':'6601100.htm', '臺中清水區':'6601200.htm','臺中沙鹿區':'6601300.htm', '臺中梧棲區':'6601400.htm','臺中后里區':'6601500.htm', '臺中神岡區':'6601600.htm','臺中潭子區':'6601700.htm', '臺中大雅區':'6601800.htm',
              '臺中新社區':'6601900.htm', '臺中石岡區':'6602000.htm','臺中外埔區':'6602100.htm', '臺中大安區':'6602200.htm','臺中烏日區':'6602300.htm', '臺中大肚區':'6602400.htm','臺中龍井區':'6602500.htm', '臺中霧峰區':'6602600.htm','臺中太平區':'6602700.htm', '臺中大里區':'6602800.htm','臺中和平區':'6602900.htm',
              '台中東區':'6600200.htm','台中南區':'6600300.htm', '台中西區':'6600400.htm','台中北區':'6600500.htm', '台中西屯區':'6600600.htm','台中南屯區':'6600700.htm', '台中北屯區':'6600800.htm','台中豐原區':'6600900.htm', '台中東勢區':'6601000.htm','台中大甲區':'6601100.htm', '台中清水區':'6601200.htm','台中沙鹿區':'6601300.htm', '台中梧棲區':'6601400.htm','台中后里區':'6601500.htm', '台中神岡區':'6601600.htm','台中潭子區':'6601700.htm', '台中大雅區':'6601800.htm',
              '台中新社區':'6601900.htm', '台中石岡區':'6602000.htm','台中外埔區':'6602100.htm', '台中大安區':'6602200.htm','台中烏日區':'6602300.htm', '台中大肚區':'6602400.htm','台中龍井區':'6602500.htm', '台中霧峰區':'6602600.htm','台中太平區':'6602700.htm', '台中大里區':'6602800.htm','台中和平區':'6602900.htm',
              '台中東區':'6600200.htm','南區':'6600300.htm', '西區':'6600400.htm','北區':'6600500.htm', '西屯':'6600600.htm','南屯':'6600700.htm', '北屯':'6600800.htm','豐原':'6600900.htm', '東勢':'6601000.htm','大甲':'6601100.htm', '清水':'6601200.htm','沙鹿':'6601300.htm', '梧棲':'6601400.htm','后里':'6601500.htm', '神岡':'6601600.htm','潭子':'6601700.htm', '大雅':'6601800.htm',
              '新社':'6601900.htm', '石岡':'6602000.htm','外埔':'6602100.htm','烏日':'6602300.htm', '大肚':'6602400.htm','龍井':'6602500.htm', '霧峰':'6602600.htm','太平':'6602700.htm', '大里':'6602800.htm','和平':'6602900.htm',
              '彰化縣彰化市':'1000701.htm', '彰化縣鹿港鎮':'1000702.htm','彰化縣和美鎮':'1000703.htm', '彰化縣線西鄉':'1000704.htm','彰化縣伸港鄉':'1000705.htm', '彰化縣福興鄉':'1000706.htm','彰化縣秀水鄉':'1000707.htm', '彰化縣花壇鄉':'1000708.htm','彰化縣芬園鄉':'1000709.htm', '彰化縣員林市':'1000710.htm','彰化縣溪湖鎮':'1000711.htm', '彰化縣田中鎮':'1000712.htm','彰化縣大村鄉':'1000713.htm', '彰化縣埔鹽鄉':'1000714.htm','彰化縣埔心鄉':'1000715.htm', '彰化縣永靖鄉':'1000716.htm','彰化縣社頭鄉':'1000717.htm', '彰化縣二水鄉':'1000718.htm',
              '彰化縣北斗鎮':'1000719.htm', '彰化縣二林鎮':'1000720.htm','彰化縣田尾鄉':'1000721.htm', '彰化縣埤頭鄉':'1000722.htm','彰化縣芳苑鄉':'1000723.htm', '彰化縣大城鄉':'1000724.htm','彰化縣竹塘鄉':'1000725.htm', '彰化縣溪州鄉':'1000726.htm',
              '彰化市':'1000701.htm', '鹿港鎮':'1000702.htm','和美鎮':'1000703.htm', '線西鄉':'1000704.htm','伸港鄉':'1000705.htm', '福興鄉':'1000706.htm','秀水鄉':'1000707.htm', '花壇鄉':'1000708.htm','芬園鄉':'1000709.htm', '員林市':'1000710.htm','溪湖鎮':'1000711.htm', '田中鎮':'1000712.htm','大村鄉':'1000713.htm', '埔鹽鄉':'1000714.htm','埔心鄉':'1000715.htm', '永靖鄉':'1000716.htm','社頭鄉':'1000717.htm', '二水鄉':'1000718.htm',
              '北斗鎮':'1000719.htm', '二林鎮':'1000720.htm','田尾鄉':'1000721.htm', '埤頭鄉':'1000722.htm','芳苑鄉':'1000723.htm', '大城鄉':'1000724.htm','竹塘鄉':'1000725.htm', '溪州鄉':'1000726.htm',
              '鹿港':'1000702.htm','和美':'1000703.htm', '線西':'1000704.htm','伸港':'1000705.htm', '福興':'1000706.htm','秀水':'1000707.htm', '花壇':'1000708.htm','芬園':'1000709.htm', '員林':'1000710.htm','溪湖':'1000711.htm', '田中':'1000712.htm','大村':'1000713.htm', '埔鹽':'1000714.htm','埔心':'1000715.htm', '永靖':'1000716.htm','社頭':'1000717.htm', '二水':'1000718.htm',
              '北斗':'1000719.htm', '二林':'1000720.htm','田尾':'1000721.htm', '埤頭':'1000722.htm','芳苑':'1000723.htm', '大城':'1000724.htm','竹塘鄉':'1000725.htm', '溪州鄉':'1000726.htm',
              '雲林縣斗六市':'1000901.htm','雲林縣斗南鎮':'1000902.htm', '雲林縣虎尾鎮':'1000903.htm','雲林縣西螺鎮':'1000904.htm', '雲林縣土庫鎮':'1000905.htm','雲林縣':'1000906.htm', '雲林縣':'1000907.htm','雲林縣':'1000908.htm', '雲林縣':'1000909.htm','雲林縣':'1000910.htm', '雲林縣':'1000911.htm','雲林縣':'1000912.htm', '雲林縣':'1000913.htm','雲林縣':'1000914.htm', '雲林縣':'1000915.htm','雲林縣':'1000916.htm', '雲林縣':'1000917.htm',
              '雲林縣':'1000918.htm', '雲林縣':'1000919.htm','雲林縣':'1000920.htm',}

@handler.add(JoinEvent)
def handle_join(event):
    line_bot_api.reply_message(
        event.reply_token,
            TextSendMessage(
                text='Joined this ' + event.source.group_id))

@handler.add(MessageEvent, message=TextMessage)
def handle_message(event):
    a = event.message.text.encode('utf-8')
    if a in locallist:
        baseurl = 'http://www.cwb.gov.tw/V7/forecast/taiwan/Keelung_City.htm'
        url = 'http://www.cwb.gov.tw/V7/forecast/taiwan/'
        resp = requests.get((url + locallist[a]))
        resp.encoding ='utf-8'
        soup = BeautifulSoup(resp.text, "lxml")

        loc = soup.find_all('th')
        tmp = soup.find_all('td')
        wtr = soup.find_all('img')

        a = loc[0].text
        b = (loc[5].text).split(' ')[0]
        c = tmp[0].text
        d = wtr[0].get('alt')
        e = tmp[2].text
        f = tmp[3].text

        content =  a + b + u'的溫度: ' + c + u'℃ ' + u'天氣狀況:'+ d + u' 舒適度:' + e + u' 降雨機率:' + f
    
        line_bot_api.reply_message(
            event.reply_token,
            TextSendMessage(text = content))

    if a in taipeilist:
        url = 'http://www.cwb.gov.tw/V7/forecast/town368/7Day/'
        loofficeurl = 'http://www.cwb.gov.tw/V7/forecast/town368/towns/'+ taipeilist[a] +'?layer=0&type=Weather&time=7Day'
        respt = requests.get((url + taipeilist[a]))
        respoff = requests.get((loofficeurl))
        respt.encoding ='utf-8'
        respoff.encoding ='utf-8'
        soup = BeautifulSoup(respt.text, "lxml")
        soupoff = BeautifulSoup(respoff.text, "lxml")
        s = soup.find_all("td")
        x = soupoff.find_all("a")
        f = x[77].text.split(u'公')[0]
        dat = soup.find_all('td')
        a = dat[1].text
        b = s[54].text
        c = s[39].text
        wtr = soup.find_all('img')
        d = wtr[0].get('alt')
        e = s[144].text
        taipei =  a + ','+ f + u'的一日氣象: ' + u'溫度:'+ b + u'~' + c + u'℃ ' + u'天氣狀況:'+ d +  u' 降雨機率:' + e
    
        line_bot_api.reply_message(
            event.reply_token,
            TextSendMessage(text = taipei))
    if event.message.text == u"你是誰":
        line_bot_api.reply_message(
            event.reply_token,
            TextSendMessage(text = u'我是新竹最帥阿麟開發的機器人~~'))
    if event.message.text == u"怎麼切換中英文":
        line_bot_api.reply_message(
            event.reply_token,
            TextSendMessage(text = u'請找到鍵盤上的123旁邊的一個很像地球的標示，長按可以直接選擇~~'))
    if event.message.text == u"桃園哪裡好玩":
        line_bot_api.reply_message(
            event.reply_token,
            TextSendMessage(text = u'賢·沙龍是你唯一的選擇！！'))
    if event.message.text == u"彰化哪裡好玩":
        line_bot_api.reply_message(
            event.reply_token,
            TextSendMessage(text = u'去摸乳.....................巷啊！！'))
    if event.message.text == u"三重哪裡好玩":
        line_bot_api.reply_message(
            event.reply_token,
            TextSendMessage(text = u'只能去找睿睿玩了~~~~~~'))
    if event.message.text == u"沒錢怎麼辦":
        line_bot_api.reply_message(
            event.reply_token,
            TextSendMessage(text = u'政府立案，合法利息，找阿通，有保障！請撥打0913905990，阿通'))
    if event.message.text == u"桃園要去哪裡買衣服":
        line_bot_api.reply_message(
            event.reply_token,
            TextSendMessage(text = u'當然是找白富美闆娘囉，優質韓貨盡在KOREA HOME!!按讚我就不知道有沒有送東西惹https://www.facebook.com/KoreaHome.M/'))
if __name__ == '__main__':
    app.run()